# все API и текст сообщений
TG_BOT_TOKEN = "5908034602:AAF8m7WF18BuoE91IcSy9jDPF_tBcan7ra4"
CHANNEL_NAME = "@zabu_news"

API_GIGA_TOKEN = "NDRjYmY1NWEtOThhNS00ODMyLWI5Y2UtNTBiMTQwOWIzYzcwOmQzY2EzZGNjLTk4NGEtNDQ0Yy05MWJlLTBlOWUxM2U1NTA0Zg=="
API_GIGA_VERS = "GIGACHAT_API_PERS"
API_GIGA_MODEL = "GigaChat-Pro"

SECOND_WELCOME_PHRASE = ("Привет, меня зовут Забушка! Можно просто Забу. Рад тебя видеть! Чем могу помочь? "
                         "Может, интересует расписание пар, какие-то события или активности?"
                         "Напиши /help и я расскажу о том, что я умею...")

HELP_INFORMATION = ("-----------------Помощь------------------- \n"
                    "/site - переходи на официальный сайт ЗабГУ \n"
                    "/where_am_I - узнай кратчайший путь от одного корпуса к другому \n"
                    "/study_buddy - здесь ты можешь сделать краткую выжимку из лекции \n"
                    "/activities - пройди опрос и узнай какое сообщество тебе подойдет лучше всего, а после оставь "
                    "заявку на зачисление! \n"
                    "/news - вывод последней новости по интересующей тебя теме \n"
                    "/freetime - полный анализ расписания на день \n \n"
                    "/goroscop - вывод гороскопа \n "
                    "/anekdot - хорошее настроение от GigaChat'a \n"
                    "Если вам интересно взглянуть на свой город по-новому, то бот-экскурсавод вам в "
                    "помощь @mksdfokfds_bot \n"
                    "Если вас заинтересовала работа с GigaChat вы можете использовать "
                    "нашу мини версию бота @Zabushka_gigabot")

NEWS_FORM = ("Напишите новость в формате: \n"
             "Название - краткое обозначение темы \n"
             "Тэг - выбрать от одного до трех(art, tech, sport) \n"
             "Описание - основная суть события \n"
             "А также прикрепите фото!")